--Cái này là Thí dụ mẫu ,Phải dùng Cái này Hàm số Của Cần thiết đến Toàn bộ Phục chế Cái này 
--Thôi Phùng Cửu 
x760412_g_ScriptId	= 760412

--Trạm dịch Sở tại Đồ idHòa XHòa Y
--x760412_g_npcsid=2
--x760412_g_npcx=160
--x760412_g_npcy=132
--Môn phái Tin tức (Cảnh tượng Tên ,SceneID,PosX,PosY, Cấp bậc)
x760412_g_mpInfo = {}
x760412_g_mpInfo1 = {}
x760412_g_mpInfo2 = {}
x760412_g_mpInfo3 = {}
x760412_g_mpInfo4 = {}
--------------------------------
x760412_g_mpInfo[1]	= { 716, 91, 91, 1 }
x760412_g_mpInfo[2]	= { 0, 327, 270, 1 }
x760412_g_mpInfo[3]	= { 1, 203, 257, 1 }
x760412_g_mpInfo[4]	= { 2, 253, 122, 1 }
x760412_g_mpInfo[5]	= { 186, 288, 136, 1 }
x760412_g_mpInfo[6]	= { 420, 200, 210, 1 }
x760412_g_mpInfo[7]	= { 197, 87, 151, 1 }
x760412_g_mpInfo[8]	= { 16, 96, 152, 1 }
x760412_g_mpInfo[9]	= { 14, 67, 145, 1 }
x760412_g_mpInfo[10]	= { 9, 96, 127, 1 }
x760412_g_mpInfo[11]	= { 17, 95, 120, 1 }
x760412_g_mpInfo[12]	= { 13, 96, 120, 1 }
x760412_g_mpInfo[13]	= { 15, 89, 139, 1 }
x760412_g_mpInfo[14]	= { 12, 103, 140, 1 }
x760412_g_mpInfo[15]	= { 11, 98, 167, 1 }
x760412_g_mpInfo[16]	= { 10, 91, 116, 1 }
x760412_g_mpInfo[17]	= { 435, 29, 135, 1 }
x760412_g_mpInfo[18]	= { 495, 129, 71, 1 }
x760412_g_mpInfo[19]	= { 580, 158, 121, 1 }
x760412_g_mpInfo[20]	= { 575, 34, 215, 1 }
x760412_g_mpInfo[21]	= { 574, 37, 41, 1 }
x760412_g_mpInfo[22]	= { 573, 147, 218, 1 }
x760412_g_mpInfo[23]	= { 496, 45, 195, 1 }
x760412_g_mpInfo[24]	= { 497, 62, 52, 1 }
x760412_g_mpInfo[25]	= { 500, 212, 190, 1 }
x760412_g_mpInfo[26]	= { 498, 57, 225, 1 }
x760412_g_mpInfo[27]	= { 497, 135, 33, 1 }
x760412_g_mpInfo[28]	= { 546, 35, 71, 1 }
x760412_g_mpInfo[29]	= { 544, 231, 233, 1 }
x760412_g_mpInfo[30]	= { 545, 38, 93, 1 }
x760412_g_mpInfo[31]	= { 560, 60, 75, 1 }
x760412_g_mpInfo[32]	= { 561, 78, 200, 1 }
x760412_g_mpInfo[33]	= { 562, 196, 188, 1 }
x760412_g_mpInfo[34]	= { 710, 134, 36, 1 }
x760412_g_mpInfo[35]	= { 708, 41, 165, 1 }
x760412_g_mpInfo[36]	= { 709, 211, 85, 1 }
x760412_g_mpInfo[37]	= { 709, 155, 150, 1 }
x760412_g_mpInfo[38]	= { 709, 155, 150, 1 }
x760412_g_mpInfo[39]	= { 709, 155, 150, 1 }
x760412_g_mpInfo[40]	= { 709, 155, 150, 1 }
x760412_g_mpInfo[41]	= { 709, 155, 150, 1 }
x760412_g_mpInfo[42]	= { 0, 255, 250, 1 }--{718, 55, 50, 1 }--
x760412_g_mpInfo[43]	= { 195, 256, 171, 1 }
--------------------
x760412_g_mpInfo1[1]	= { 1, 365, 248, 1 }
x760412_g_mpInfo1[2]	= { 2, 228, 89, 1 }
x760412_g_mpInfo1[3]	= { 2, 245, 176, 1 }
x760412_g_mpInfo1[4]	= { 2, 219, 186, 1 }
x760412_g_mpInfo1[5]	= { 2, 105, 153, 1 }
x760412_g_mpInfo1[6]	= { 2, 98, 128, 1 }
x760412_g_mpInfo1[7]	= { 2, 240, 91, 1 }
x760412_g_mpInfo1[8]	= { 2, 300, 204, 1 }
x760412_g_mpInfo1[9]	= { 2, 98, 122, 1 }
x760412_g_mpInfo1[10]	= { 2, 28, 239, 1 }
x760412_g_mpInfo1[11]	= { 2, 186, 70, 1 }
x760412_g_mpInfo1[12]	= { 2, 145, 120, 1 }
x760412_g_mpInfo1[13]	= { 1, 353, 234, 1 }
x760412_g_mpInfo1[14]	= { 0, 318, 315, 1 }
x760412_g_mpInfo1[15]	= { 0, 282, 320, 1 }
x760412_g_mpInfo1[16]	= { 1, 361, 242, 1 }
x760412_g_mpInfo1[17]	= { 580, 196, 216, 1 }
x760412_g_mpInfo1[18]	= { 1, 281, 275, 1 }
x760412_g_mpInfo1[19]	= { 1, 178, 236, 1 }
x760412_g_mpInfo1[20]	= { 0, 276, 293, 1 }
x760412_g_mpInfo1[21]	= { 1, 353, 269, 1 }
x760412_g_mpInfo1[22]	= { 1, 350, 228, 1 }
x760412_g_mpInfo1[23]	= { 1, 265, 234, 1 }
x760412_g_mpInfo1[24]	= { 1, 225, 225, 1 }
x760412_g_mpInfo1[25]	= { 1, 230, 349, 1 }
x760412_g_mpInfo1[26]	= { 0, 329, 296, 1 }
x760412_g_mpInfo1[27]	= { 0, 237, 236, 1 }
x760412_g_mpInfo1[28]	= { 0, 239, 252, 1 }
x760412_g_mpInfo1[29]	= { 1, 173, 361, 1 }
x760412_g_mpInfo1[30]	= { 0, 345, 271, 1 }
x760412_g_mpInfo1[31]	= { 0, 143, 177, 1 }
x760412_g_mpInfo1[32]	= { 0, 151, 183, 1 }
x760412_g_mpInfo1[33]	= { 0, 238, 204, 1 }
x760412_g_mpInfo1[34]	= { 0, 140, 182, 1 }
x760412_g_mpInfo1[35]	= { 2, 140, 194, 1 }
x760412_g_mpInfo1[36]	= { 2, 240, 30, 1 }
x760412_g_mpInfo1[37]	= { 580, 121, 201, 1 }
x760412_g_mpInfo1[38]	= { 580, 115, 202, 1 }
x760412_g_mpInfo1[39]	= { 580, 143, 201, 1 }
x760412_g_mpInfo1[40]	= { 580, 247, 218, 1 }
x760412_g_mpInfo1[41]	= { 580, 152, 69, 1 }
x760412_g_mpInfo1[42]	= { 0, 218, 240, 1 }
x760412_g_mpInfo1[43]	= { 0, 212, 322, 1 }
x760412_g_mpInfo1[44]	= { 0, 207, 342, 1 }
x760412_g_mpInfo1[45]	= { 2, 141, 141, 1 }
x760412_g_mpInfo1[46]	= { 2, 172, 143, 1 }
x760412_g_mpInfo1[47]	= { 2, 292, 90, 1 }
x760412_g_mpInfo1[48]	= { 2, 131, 78, 1 }
x760412_g_mpInfo1[49]	= { 2, 205, 55, 1 }
x760412_g_mpInfo1[50]	= { 2, 239, 30, 1 }
x760412_g_mpInfo1[51]	= { 0, 341, 271, 1 }
x760412_g_mpInfo1[52]	= { 0, 244, 244, 1 }
x760412_g_mpInfo1[53]	= { 0, 140, 181, 1 }
x760412_g_mpInfo1[54]	= { 580, 158, 47, 1 }
x760412_g_mpInfo1[55]	= { 1, 274, 240, 1 }
x760412_g_mpInfo1[56]	= { 0, 255, 247, 1 }
x760412_g_mpInfo1[57]	= { 2, 159, 174, 1 }
--------------------------------
x760412_g_mpInfo2[1]	= { 6, 43, 172, 1 }
x760412_g_mpInfo2[2]	= { 7, 40, 278, 1 }
x760412_g_mpInfo2[3]	= { 24, 275, 41, 1 }
x760412_g_mpInfo2[4]	= { 172, 36, 236, 1 }
x760412_g_mpInfo2[5]	= { 26, 261, 127, 1 }
x760412_g_mpInfo2[6]	= { 27, 44, 53, 1 }
x760412_g_mpInfo2[7]	= { 177, 25, 23, 1 }
x760412_g_mpInfo2[8]	= { 176, 235, 25, 1 }
x760412_g_mpInfo2[9]	= { 415, 46, 27, 1 }
x760412_g_mpInfo2[10]	= { 517, 97, 95, 1 }
x760412_g_mpInfo2[11]	= { 28, 274, 45, 1 }
x760412_g_mpInfo2[12]	= { 29, 67, 45, 1 }
x760412_g_mpInfo2[13]	= { 8, 276, 145, 1 }
x760412_g_mpInfo2[14]	= { 3, 42, 54, 1 }
x760412_g_mpInfo2[15]	= { 18, 264, 278, 1 }
x760412_g_mpInfo2[16]	= { 170, 22, 225, 1 }
x760412_g_mpInfo2[17]	= { 19, 228, 273, 1 }
x760412_g_mpInfo2[18]	= { 156, 41, 218, 1 }
x760412_g_mpInfo2[19]	= { 20, 278, 255, 1 }
x760412_g_mpInfo2[20]	= { 174, 230, 230, 1 }
x760412_g_mpInfo2[21]	= { 21, 63, 288, 1 }
x760412_g_mpInfo2[22]	= { 175, 125, 30, 1 }
x760412_g_mpInfo2[23]	= { 188, 60, 222, 1 }
x760412_g_mpInfo2[24]	= { 22, 39, 269, 1 }
x760412_g_mpInfo2[25]	= { 23, 49, 272, 1 }
x760412_g_mpInfo2[26]	= { 179, 115, 220, 1 }
x760412_g_mpInfo2[27]	= { 4, 218, 271, 1 }
x760412_g_mpInfo2[28]	= { 5, 277, 46, 1 }
x760412_g_mpInfo2[29]	= { 30, 39, 52, 1 }
x760412_g_mpInfo2[30]	= { 121, 84, 48, 1 }
x760412_g_mpInfo2[31]	= { 168, 26, 216, 1 }
x760412_g_mpInfo2[32]	= { 31, 42, 267, 1 }
x760412_g_mpInfo2[33]	= { 169, 60, 222, 1 }
x760412_g_mpInfo2[34]	= { 531, 263, 51, 1 }
x760412_g_mpInfo2[35]	= { 532, 49, 220, 1 }
x760412_g_mpInfo2[36]	= { 32, 43, 40, 1 }
x760412_g_mpInfo2[37]	= { 173, 110, 221, 1 }
x760412_g_mpInfo2[38]	= { 33, 42, 269, 1 }
x760412_g_mpInfo2[39]	= { 157, 89, 232, 1 }
x760412_g_mpInfo2[40]	= { 34, 40, 37, 1 }
x760412_g_mpInfo2[41]	= { 178, 44, 218, 1 }
x760412_g_mpInfo2[42]	= { 35, 275, 277, 1 }
x760412_g_mpInfo2[43]	= { 424, 27, 37, 1 }
x760412_g_mpInfo2[44]	= { 431, 193, 227, 1 }
x760412_g_mpInfo2[45]	= { 425, 31, 27, 1 }
x760412_g_mpInfo2[46]	= { 520, 100, 99, 1 }
x760412_g_mpInfo2[47]	= { 423, 28, 230, 1 }
x760412_g_mpInfo2[48]	= { 519, 71, 29, 1 }
x760412_g_mpInfo2[49]	= { 427, 38, 24, 1 }
x760412_g_mpInfo2[50]	= { 541, 107, 24, 1 }
x760412_g_mpInfo2[51]	= { 421, 93, 37, 1 }
x760412_g_mpInfo2[52]	= { 432, 90, 86, 1 }
x760412_g_mpInfo2[53]	= { 536, 40, 222, 1 }
x760412_g_mpInfo2[54]	= { 537, 25, 98, 1 }
x760412_g_mpInfo2[55]	= { 39, 109, 25, 1 }
x760412_g_mpInfo2[56]	= { 158, 226, 215, 1 }
x760412_g_mpInfo2[57]	= { 400, 227, 195, 1 }
x760412_g_mpInfo2[58]	= { 401, 211, 224, 1 }
x760412_g_mpInfo2[59]	= { 402, 230, 215, 1 }
x760412_g_mpInfo2[60]	= { 538, 33, 37, 1 }
--------------------------------
x760412_g_mpInfo3[1]	= { 123, 233, 228, 1 }
x760412_g_mpInfo3[2]	= { 126, 231, 225, 1 }
x760412_g_mpInfo3[3]	= { 148, 18, 228, 1 }
x760412_g_mpInfo3[4]	= { 149, 25, 240, 1 }
x760412_g_mpInfo3[5]	= { 150, 128, 238, 1 }
x760412_g_mpInfo3[6]	= { 159, 66, 89, 1 }
x760412_g_mpInfo3[7]	= { 160, 87, 89, 1 }
x760412_g_mpInfo3[8]	= { 161, 13, 25, 1 }
x760412_g_mpInfo3[9]	= { 162, 102, 18, 1 }
x760412_g_mpInfo3[10]	= { 163, 24, 24, 1 }
x760412_g_mpInfo3[11]	= { 164, 65, 108, 1 }
x760412_g_mpInfo3[12]	= { 165, 28, 108, 1 }
x760412_g_mpInfo3[13]	= { 166, 14, 14, 1 }
x760412_g_mpInfo3[14]	= { 167, 20, 18, 1 }
x760412_g_mpInfo3[15]	= { 139, 45, 40, 1 }
x760412_g_mpInfo3[16]	= { 140, 44, 39, 1 }
x760412_g_mpInfo3[17]	= { 141, 97, 58, 1 }
x760412_g_mpInfo3[18]	= { 142, 80, 50, 1 }
x760412_g_mpInfo3[19]	= { 143, 95, 35, 1 }
x760412_g_mpInfo3[20]	= { 144, 140, 40, 1 }
x760412_g_mpInfo3[21]	= { 145, 45, 35, 1 }
x760412_g_mpInfo3[22]	= { 146, 140, 50, 1 }
x760412_g_mpInfo3[23]	= { 147, 95, 45, 1 }
x760412_g_mpInfo3[24]	= { 329, 52, 25, 1 }
x760412_g_mpInfo3[25]	= { 328, 83, 104, 1 }
x760412_g_mpInfo3[26]	= { 200, 95, 55, 1 }
x760412_g_mpInfo3[27]	= { 188, 83, 37, 1 }
x760412_g_mpInfo3[28]	= { 150, 127, 25, 1 }
x760412_g_mpInfo3[29]	= { 170, 216, 176, 1 }
x760412_g_mpInfo3[30]	= { 32, 155, 169, 1 }
x760412_g_mpInfo3[31]	= { 39, 181, 200, 1 }
x760412_g_mpInfo3[32]	= { 25, 62, 254, 1 }
x760412_g_mpInfo3[33]	= { 20, 146, 108, 1 }
x760412_g_mpInfo3[34]	= { 5, 250, 89, 1 }
x760412_g_mpInfo3[35]	= { 158, 141, 110, 1 }
x760412_g_mpInfo3[36]	= { 400, 57, 208, 1 }
x760412_g_mpInfo3[37]	= { 401, 168, 155, 1 }
x760412_g_mpInfo3[38]	= { 402, 145, 85, 1 }
x760412_g_mpInfo3[39]	= { 538, 64, 202, 1 }
x760412_g_mpInfo3[40]	= { 18, 170, 68, 1 }
x760412_g_mpInfo3[41]	= { 158, 147, 91, 1 }
x760412_g_mpInfo3[42]	= { 121, 154, 168, 1 }
x760412_g_mpInfo3[43]	= { 174, 113, 98, 1 }
x760412_g_mpInfo3[44]	= { 22, 163, 145, 1 }
--------------------------------
x760412_g_mpInfo4[1]	= { 0, 301, 193, 1 }
x760412_g_mpInfo4[2]	= { 1, 134, 257, 1 }
x760412_g_mpInfo4[3]	= { 186, 293, 68, 75 }
x760412_g_mpInfo4[4]	= { 0, 366, 228, 1 }
x760412_g_mpInfo4[5]	= { 3, 107, 110, 1 }
x760412_g_mpInfo4[6]	= { 2, 131, 79, 1 }
x760412_g_mpInfo4[7]	= { 4, 72, 119, 1 }
x760412_g_mpInfo4[8]	= { 186, 191, 222, 75 }
x760412_g_mpInfo4[9]	= { 186, 191, 222, 75 }
x760412_g_mpInfo4[10]	= { 186, 161, 76, 75 }
x760412_g_mpInfo4[11]	= { 2, 72, 56, 1 }
x760412_g_mpInfo4[12]	= { 0, 218, 243, 1 }
x760412_g_mpInfo4[13]	= { 1, 194, 213, 1 }
x760412_g_mpInfo4[14]	= { 186, 211, 173, 75 }
x760412_g_mpInfo4[15]	= { 1, 339, 308, 1 }
x760412_g_mpInfo4[16]	= { 186, 172, 118, 80 }
x760412_g_mpInfo4[17]	= { 580, 286, 68, 85 }
x760412_g_mpInfo4[18]	= { 580, 287, 81, 85 }
x760412_g_mpInfo4[19]	= { 420, 150, 144, 85 }
x760412_g_mpInfo4[20]	= { 186, 160, 44, 75 }
x760412_g_mpInfo4[21]	= { 158, 133, 109, 10 }
x760412_g_mpInfo4[22]	= { 2, 292, 91, 10 }
x760412_g_mpInfo4[23]	= { 0, 238, 237, 10 }
x760412_g_mpInfo4[24]	= { 18, 265, 275, 10 }
x760412_g_mpInfo4[25]	= { 2, 91, 199, 10 }
x760412_g_mpInfo4[26]	= { 5, 199, 54, 10 }
x760412_g_mpInfo4[27]	= { 435, 68, 133, 10 }
---------------------------------------------------------------
x760412_g_Yinpiao = 40002000
x760412_g_Impact_NotTransportList = { 5929, 5944 } -- Cấm Truyền tống Của Impact
--Dự bị ,Bắt đầu 
function x760412_yizhanbox(sceneId, selfId, Msg)
	BeginEvent(sceneId)
		AddText(sceneId, Msg)
	EndEvent(sceneId)
	DispatchMissionTips(sceneId, selfId)
end
--**********************************
--Sự kiện Lẫn nhau Nhập khẩu 
--**********************************
function x760412_OnDefaultEvent(sceneId, selfId, targetId)
		BeginUICommand(sceneId)
		EndUICommand(sceneId)
		DispatchUICommand(sceneId, selfId, 20170503)
end
function x760412_xunzhaocy(sceneId, selfId, key, keyy)
local cssceneId = 0
local csx = 0
local csy = 0
local csdj = 0
	if keyy == 1 then
		cssceneId = x760412_g_mpInfo[key][1]
		csx = x760412_g_mpInfo[key][2]
		csy = x760412_g_mpInfo[key][3]
		csdj = x760412_g_mpInfo[key][4]
	elseif keyy == 2 then
		cssceneId = x760412_g_mpInfo1[key][1]
		csx = x760412_g_mpInfo1[key][2]
		csy = x760412_g_mpInfo1[key][3]
		csdj = x760412_g_mpInfo1[key][4]
	elseif keyy == 3 then
		cssceneId = x760412_g_mpInfo2[key][1]
		csx = x760412_g_mpInfo2[key][2]
		csy = x760412_g_mpInfo2[key][3]
		csdj = x760412_g_mpInfo2[key][4]
	elseif keyy == 4 then
		cssceneId = x760412_g_mpInfo3[key][1]
		csx = x760412_g_mpInfo3[key][2]
		csy = x760412_g_mpInfo3[key][3]
		csdj = x760412_g_mpInfo3[key][4]
	elseif keyy == 5 then
		cssceneId = x760412_g_mpInfo4[key][1]
		csx = x760412_g_mpInfo4[key][2]
		csy = x760412_g_mpInfo4[key][3]
		csdj = x760412_g_mpInfo4[key][4]
	end
	if (cssceneId == nil) then
		return
	end
	if (csx == 0) then
		return
	end
	if (csy == 0) then
		return
	end	
	CallScriptFunction((400900),"TransferFunc", sceneId, selfId, cssceneId, csx, csy, csdj);
end

function x760412_callcy(sceneId, selfId, key, keyy)
if key> 0 and key <61 then
if keyy> 0 and keyy <6 then
	x760412_xunzhaocy(sceneId, selfId, key, keyy)
end
end
end
