--×¢Òâ£º

--ÎïÆ·¼¼ÄÜµÄÂß¼­Ö»ÄÜÊ¹ÓÃ»ù´¡¼¼ÄÜºÍ½Å±¾À´ÊµÏÖ

--½Å±¾:

--ÒÔÏÂÊÇ½Å±¾ÑùÀı:
------------------------------------------------------------------------------------------
--Ğ£·şÀñ°üµÄÄ¬ÈÏ½Å±¾
--½Å±¾ºÅ
x889045_g_scriptId = 889045

x889045_XieziBags = {} --ÎïÆ·id£¬×îĞ¡ÊıÁ¿£¬×î´óÊıÁ¿
--x889045_XieziBags[30008109] = {{38001103,1,1},{50613004,1,1},{39901012,1,1},{30008112,1,1}} --2000ºÀÇéÀñºĞ
--x889045_XieziBags[30008110] = {{20301010,1,1},{30008105,1,1},{39901012,2,2},{30008112,5,12}} --8000ºÀÇéÀñºĞ
--x889045_XieziBags[30008111] = {{10553110,1,1},{30309855,1,1},{39901012,5,5},{30008112,20,30}} --20000ºÀÇéÀñºĞ

x889045_XieziBags[30009099] = {{30009101,1,1}} 
x889045_XieziBags[30009101] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009102] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009103] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009104] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009105] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009106] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009107] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009108] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009109] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009110] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009111] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009112] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009113] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009114] = {{50503001,1,1},{50514001,1,1}}
x889045_XieziBags[30009115] = {{50503001,1,1},{50514001,1,1}}
--x889045_XieziBags[30009116] = {{50503001,1,1},{50514001,1,1}}


--x889045_XieziBags[30009601] = {{10141215,1,1},{10141216,1,1},{30110010,2,2},{39901012,2,2}} --×··çÀñºĞ
--x889045_XieziBags[30009602] = {{10157009,1,1},{10155021,1,1},{30110010,1,1},{50613004,1,1}} --Õ½ÉñÀñºĞ
--x889045_XieziBags[30009603] = {{30309854,1,1},{30309855,1,1},{30402058,1,1},{30501171,50,50}} --ÉñÊŞÀñºĞ

--**********************************
--ÊÂ¼ş½»»¥Èë¿Ú
--**********************************
function x889045_OnDefaultEvent( sceneId, selfId, bagIndex )
-- ²»ĞèÒªÕâ¸ö½Ó¿Ú£¬µ«Òª±£Áô¿Õº¯Êı
end

--**********************************
--Õâ¸öÎïÆ·µÄÊ¹ÓÃ¹ı³ÌÊÇ·ñÀàËÆÓÚ¼¼ÄÜ£º
--ÏµÍ³»áÔÚÖ´ĞĞ¿ªÊ¼Ê±¼ì²âÕâ¸öº¯ÊıµÄ·µ»ØÖµ£¬Èç¹û·µ»ØÊ§°ÜÔòºöÂÔºóÃæµÄÀàËÆ¼¼ÄÜµÄÖ´ĞĞ¡£
--·µ»Ø1£º¼¼ÄÜÀàËÆµÄÎïÆ·£¬¿ÉÒÔ¼ÌĞøÀàËÆ¼¼ÄÜµÄÖ´ĞĞ£»·µ»Ø0£ººöÂÔºóÃæµÄ²Ù×÷¡£
--**********************************
function x889045_IsSkillLikeScript( sceneId, selfId)
	return 1; --Õâ¸ö½Å±¾ĞèÒª¶¯×÷Ö§³Ö
end

--**********************************
--Ö±½ÓÈ¡ÏûĞ§¹û£º
--ÏµÍ³»áÖ±½Óµ÷ÓÃÕâ¸ö½Ó¿Ú£¬²¢¸ù¾İÕâ¸öº¯ÊıµÄ·µ»ØÖµÈ·¶¨ÒÔºóµÄÁ÷³ÌÊÇ·ñÖ´ĞĞ¡£
--·µ»Ø1£ºÒÑ¾­È¡Ïû¶ÔÓ¦Ğ§¹û£¬²»ÔÙÖ´ĞĞºóĞø²Ù×÷£»·µ»Ø0£ºÃ»ÓĞ¼ì²âµ½Ïà¹ØĞ§¹û£¬¼ÌĞøÖ´ĞĞ¡£
--**********************************
function x889045_CancelImpacts( sceneId, selfId )
	return 0; --²»ĞèÒªÕâ¸ö½Ó¿Ú£¬µ«Òª±£Áô¿Õº¯Êı,²¢ÇÒÊ¼ÖÕ·µ»Ø0¡£
end

--**********************************
--Ìõ¼ş¼ì²âÈë¿Ú£º
--ÏµÍ³»áÔÚ¼¼ÄÜ¼ì²âµÄÊ±¼äµãµ÷ÓÃÕâ¸ö½Ó¿Ú£¬²¢¸ù¾İÕâ¸öº¯ÊıµÄ·µ»ØÖµÈ·¶¨ÒÔºóµÄÁ÷³ÌÊÇ·ñÖ´ĞĞ¡£
--·µ»Ø1£ºÌõ¼ş¼ì²âÍ¨¹ı£¬¿ÉÒÔ¼ÌĞøÖ´ĞĞ£»·µ»Ø0£ºÌõ¼ş¼ì²âÊ§°Ü£¬ÖĞ¶ÏºóĞøÖ´ĞĞ¡£
--**********************************
function x889045_OnConditionCheck( sceneId, selfId )
	
	--Ğ£ÑéÊ¹ÓÃµÄÎïÆ·
	if(1~=LuaFnVerifyUsedItem(sceneId, selfId)) then
		return 0
	end

	--»ñµÃÎïÆ·ID
	local Item = LuaFnGetItemIndexOfUsedItem(sceneId, selfId)

	--¼ì²â±³°ü¿Õ¼äÊÇ·ñ×ã¹»
	local GiftNum = getn(x889045_XieziBags[Item])
	local mySpace = GiftNum +1
	local PropertySpace = LuaFnGetPropertyBagSpace(sceneId,selfId)
	local MaterialSpace = LuaFnGetMaterialBagSpace(sceneId,selfId)
	if PropertySpace < mySpace or  MaterialSpace < mySpace  then
            x889045_MsgBox(sceneId,selfId," Xin hãy ch×a tr¯ng ô ğÕo và ô nguyên li®u ít nh¤t "..mySpace.." ch² tr¯ng ")
	    return 0
	end

	return 1; --²»ĞèÒªÈÎºÎÌõ¼ş£¬²¢ÇÒÊ¼ÖÕ·µ»Ø1¡£
end

--**********************************
--ÏûºÄ¼ì²â¼°´¦ÀíÈë¿Ú£º
--ÏµÍ³»áÔÚ¼¼ÄÜÏûºÄµÄÊ±¼äµãµ÷ÓÃÕâ¸ö½Ó¿Ú£¬²¢¸ù¾İÕâ¸öº¯ÊıµÄ·µ»ØÖµÈ·¶¨ÒÔºóµÄÁ÷³ÌÊÇ·ñÖ´ĞĞ¡£
--·µ»Ø1£ºÏûºÄ´¦ÀíÍ¨¹ı£¬¿ÉÒÔ¼ÌĞøÖ´ĞĞ£»·µ»Ø0£ºÏûºÄ¼ì²âÊ§°Ü£¬ÖĞ¶ÏºóĞøÖ´ĞĞ¡£
--×¢Òâ£ºÕâ²»¹â¸ºÔğÏûºÄµÄ¼ì²âÒ²¸ºÔğÏûºÄµÄÖ´ĞĞ¡£
--**********************************
function x889045_OnDeplete( sceneId, selfId )
	
	if(0<LuaFnDepletingUsedItem(sceneId, selfId)) then
		return 1;
	end
	return 0;
end

--**********************************
--Ö»»áÖ´ĞĞÒ»´ÎÈë¿Ú£º
--¾ÛÆøºÍË²·¢¼¼ÄÜ»áÔÚÏûºÄÍê³Éºóµ÷ÓÃÕâ¸ö½Ó¿Ú£¨¾ÛÆø½áÊø²¢ÇÒ¸÷ÖÖÌõ¼ş¶¼Âú×ãµÄÊ±ºò£©£¬¶øÒıµ¼
--¼¼ÄÜÒ²»áÔÚÏûºÄÍê³Éºóµ÷ÓÃÕâ¸ö½Ó¿Ú£¨¼¼ÄÜµÄÒ»¿ªÊ¼£¬ÏûºÄ³É¹¦Ö´ĞĞÖ®ºó£©¡£
--·µ»Ø1£º´¦Àí³É¹¦£»·µ»Ø0£º´¦ÀíÊ§°Ü¡£
--×¢£ºÕâÀïÊÇ¼¼ÄÜÉúĞ§Ò»´ÎµÄÈë¿Ú
--**********************************
function x889045_OnActivateOnce( sceneId, selfId )

	--Ğ£ÑéÊ¹ÓÃµÄÎïÆ·
	--if(1~=LuaFnVerifyUsedItem(sceneId, selfId)) then
	--	return 0
	--end

	--»ñµÃÎïÆ·ID
	local Item = LuaFnGetItemIndexOfUsedItem(sceneId, selfId)

	--¼ì²â±³°ü¿Õ¼äÊÇ·ñ×ã¹»
	local GiftNum = getn(x889045_XieziBags[Item])
	local mySpace = GiftNum +1
	local PropertySpace = LuaFnGetPropertyBagSpace(sceneId,selfId)
	local MaterialSpace = LuaFnGetMaterialBagSpace(sceneId,selfId)
	if PropertySpace < mySpace or MaterialSpace < mySpace then
            x889045_MsgBox(sceneId,selfId," Xin hãy ch×a tr¯ng ô ğÕo và ô nguyên li®u ít nh¤t "..mySpace.." ch² tr¯ng ")
	    return 0
	end

	--¸øÍæ¼ÒÃ¿¸öÀñ°üµÄÀñÎï
	for i=1,GiftNum do
          local number = 0
          if x889045_XieziBags[Item][i][2] ~= x889045_XieziBags[Item][i][3] then
             number = random(x889045_XieziBags[Item][i][2],x889045_XieziBags[Item][i][3])
          else
             number = x889045_XieziBags[Item][i][2]
          end
          for j=1,number do
              TryRecieveItem(sceneId,selfId,x889045_XieziBags[Item][i][1],1)
          end
		  
          x889045_MsgBox(sceneId,selfId,"Chúc m×ng các hÕ ğã nh§n ğßşc #{_ITEM"..x889045_XieziBags[Item][i][1].."}"..number.." cái")
		  
        end

	return 1;
end

--**********************************
--Òıµ¼ĞÄÌø´¦ÀíÈë¿Ú£º
--Òıµ¼¼¼ÄÜ»áÔÚÃ¿´ÎĞÄÌø½áÊøÊ±µ÷ÓÃÕâ¸ö½Ó¿Ú¡£
--·µ»Ø£º1¼ÌĞøÏÂ´ÎĞÄÌø£»0£ºÖĞ¶ÏÒıµ¼¡£
--×¢£ºÕâÀïÊÇ¼¼ÄÜÉúĞ§Ò»´ÎµÄÈë¿Ú
--**********************************
function x889045_OnActivateEachTick( sceneId, selfId)
	return 1; --²»ÊÇÒıµ¼ĞÔ½Å±¾, Ö»±£Áô¿Õº¯Êı.
end

--**********************************
--ĞÑÄ¿ĞÅÏ¢ÌáÊ¾
--**********************************
function x889045_MsgBox( sceneId, selfId, msg )
	BeginEvent( sceneId )
		AddText( sceneId, msg )
	EndEvent( sceneId )
	DispatchMissionTips( sceneId, selfId )
end

