
x895106_g_ScriptId = 895106
zuobiao={}
zuobiao[537]={
{31,34},{45,31},{57,26},{78,23},{97,24},{108,34},{106,46},{103,67},{102,85},{100,99},{79,104},{67,104},{53,101},{52,90},{51,68},{51,57},{66,54},{63,60},
{77,49},{85,42},{87,52},{85,66},{87,74},{75,82}
} --圣火

zuobiao[538]={
{46,43},{64,40},{69,50},{77,62},{65,69},{43,72},{33,77},{68,69},{104,60},{85,34},{112,47},{105,58},{128,47},{150,49},{167,37},{181,39},{191,40},{213,76},
{219,96},{225,113},{211,118},{201,109},{187,100},{172,101},{160,101},{149,101},{127,101},{137,115},{129,125},{122,139},{124,150},{112,129},{106,127},{97,129},{98,129},
{87,123},{79,137},{67,148},{56,140},{46,152},{223,124},{227,154},{212,152},{209,140},{194,140},{189,160},{189,170},{173,170},{171,184},{176,202},{193,204},
{207,196},{154,184},{154,161},{133,217},{132,189},{118,197},{101,197},{101,208},{80,210},{77,188},{61,179},{68,220},{38,225},{29,207},{45,178},{72,182},{58,206},{195}
} --地四

zuobiao[519]={
{74,36},{82,36},{91,38},{95,46},{92,56},{81,53},{80,46},{69,46},{49,51},{47,42},{45,52},{55,57},{47,68},{41,80},{46,91},{56,95},{62,87},{70,79},{80,78},{79,89},{76,97},{88,98},{97,79},{98,89},{97,100}

} --火焰谷

zuobiao[520]={
{97,97},{99,95},{97,82},{89,86},{79,85},{71,83},{61,82},{50,80},{44,89},{50,98},{62,99},{71,100},{72,91},{91,75},{93,59},{103,57},{102,45},{101,32},{92,25},{80,23},{66,26},{53,27},{48,36},
{38,43},{28,45},{29,58},{38,63},{49,61},{55,57},{67,63},{80,62},{75,49},{65,39},{54,38},{59,51},{53,22},{29,76},{26,98},

} --高昌迷宫

zuobiao[427]={
{42,27},{33,33},{30,43},{32,52},{50,47},{44,37},{58,36},{69,40},{75,29},{84,32},{90,28},{93,35},{104,39},{91,48},{99,55},{82,60},{68,64},{58,68},{56,79},{58,89},{71,82},{105,71},{98,75},{93,79},{105,78},{106,83},{97,83},{89,84},{105,90},{89,97},{77,102},{48,102},{38,106},{34,104},{32,96},{20,96},{26,86},{39,82},{33,73},{31,60},{42,60},{47,51},{27,45},
} --塔克拉玛干

zuobiao[432]={
{87,89},{82,83},{88,97},{86,104},{77,97},{75,89},{67,85},{63,94},{59,89},{54,96},{53,86},{59,80},{54,75},{43,94},{38,106},{30,100},{31,82},{32,68},{41,60},{49,55},{42,45},{31,42},{32,34},{46,36},{58,42},{69,39},{69,51},{71,60},{81,60},{92,59},{89,54},{90,86},
} --汗血岭

zuobiao[421]={
{91,38},{87,34},{80,43},{82,47},{73,33},{60,30},{55,41},{48,35},{41,29},{33,26},{25,30},{29,42},{44,43},{67,54},{70,64},{64,70},{68,82},{65,86},{65,86},{65,95},{65,103},{54,101},{45,101},{39,93},{36,84},{32,75},{37,70},{44,69},{47,83},{76,92},{86,91},{89,85},{89,79},{90,73},{86,68},{78,79},
} --昆仑福地


function x895106_OnDie( sceneId, selfId, killerId )
	if LuaFnIsObjValid( sceneId, killerId ) ~= 1  then
		return
	end
	if sceneId ~= 537 and sceneId ~= 538 and sceneId ~= 519 and sceneId ~= 520 and sceneId ~= 427 and sceneId ~= 432 and sceneId ~= 421 then
		return
	end
	if sceneId== 537 then
		ditu = "圣火宫"
	elseif sceneId == 538 then
		ditu = "秦皇地宫四层"
	elseif sceneId == 519 then
		ditu = "火焰谷"
	elseif sceneId == 520 then
		ditu = "高昌迷宫"
	elseif sceneId == 427 then
		ditu = "塔克拉玛干"
	elseif sceneId == 432 then
		ditu = "汗血岭"
	elseif sceneId == 421 then
		ditu = "昆仑福地"
	end

	---宠物则获取其主人的名字
	local nam  = 	LuaFnGetName( sceneId, killerId )
	local playerID = killerId
	local objType = GetCharacterType( sceneId, killerId )
	if objType == 3 then
		playerID = GetPetCreator( sceneId, killerId )
		nam =  GetName( sceneId, playerID )
	end

	local  jv = random (200)
	if jv == 119 then
		zuobiaoSJ = random (getn(zuobiao[sceneId]) )
		--x895106_NotifyTip( sceneId, killerId,getn(zuobiao[sceneId]))
		local MstId = LuaFnCreateMonster(sceneId, 51000, zuobiao[sceneId][zuobiaoSJ][1], zuobiao[sceneId][zuobiaoSJ][2], 6, 0, -1 )--刷怪
		SetCharacterName( sceneId, MstId,"契丹刺客")
		SetCharacterTitle(sceneId, MstId, "#cFF0000机缘密怪")
		BroadMsgByChatPipe( sceneId, killerId, "#ccc33cc机缘：#W"..nam.."#c33ff99少侠正在#cFF0000"..ditu.."#c33ff99游神天外，忽然人品大发喜从天降一只#cFF0000机缘密怪["..zuobiao[sceneId][zuobiaoSJ][1]..","..zuobiao[sceneId][zuobiaoSJ][2].."]#c33ff99。 大声笑道“哈哈哈，都是我的了”", 4 )		
		x895106_NotifyTip( sceneId, killerId, "机缘密怪刷新在（"..zuobiao[sceneId][zuobiaoSJ][1].."，"..zuobiao[sceneId][zuobiaoSJ][2].."）,请赶紧击杀。")
	end

end



function x895106_NotifyTip( sceneId, selfId, Msg )
	BeginEvent( sceneId )
		AddText( sceneId, Msg )
	EndEvent( sceneId )
	DispatchMissionTips( sceneId, selfId )
end


--JZVMRU作式了中以我些开作上

--了要发我些展581581481F
